refgraph.org
#+TITLE: Reference Graph Visualization
#+AUTHOR: timor

#+OPTIONS: ':nil *:t -:t ::t <:t H:4 \n:nil ^:nil arch:headline
#+OPTIONS: author:t c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t title:t toc:t todo:t |:t

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>

#+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/lib/js/jquery.stickytableheaders.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/readtheorg/js/readtheorg.js"></script>

* Idea
- Goal: get overview over certain scientific field by taking advantage
  of the information that is usually provided by reference managers,
  in addition to information that is usually provided by task planning systems.
- extract information from BibTeX files:
  - author-paper relation
  - number of citations per paper (custom field)
- combine with:
  - personal progress on papers
  - personal classification on papers
- several visualization modes
  1. Collaboration Graph
  2. Classification (WIP)

* Usage
Open =index.html= (with Firefox).

When the page loads, an example graph is displayed.  To display your
own data, drag a file onto the canvas graph and drop it.

The layout is responsive, and nodes can be dragged with the mouse.
Dragging the background will pan the view, and mouse wheel can be used
to zoom.

Clicking a paper will try to open a pdf file with the same name in the
current directory. (Note: this will be changed to use the file name
property in the BibTex file.)

Clicking an author will redirect to a Google Scholar search with that author.

Only tested on Firefox.

** Advanced
If something unexpected happened during BibTeX file loading, a warning
or error message is printed to the browser's console.

Additional information in non-standard fields is taken into account:

- =note= :: number of citations, as generated by the Zotero citations
     plugin
- =state= :: personal reading state, causes colored representation of
     said state.  Currently supported values: =unread=, =started=,
     =overview=, and =read=
- =classification= :: (WIP) classification of a paper in the form of
     =category/sub category 1/further sub-category=
* Implementation
The application basically consists of one html file that includes the
necessary CSS and Javascript.

It depends on d3.js for the
visualization, and on md5.js and a modified version of jdenticon for
identicon generation.

The [[id:034811f6-5a5d-4c94-9bd2-7afa932aafe0][Parser]] responsible for extracting the information from the BibTex
files is generated using PEG.js.

#+BEGIN_SRC html :tangle index.html :noweb tangle
  <!DOCTYPE html>
  <head>
    <meta charset="utf-8">
    <title>BibTeX Graph Visualization (with d3.js)</title>
  </head>
  <style>

    <<css-definitions>>

  </style>
  <body>
    <svg height="100%" width="100%"></svg>
    <div id="footer">
      <p> Drag'n'Drop your BibTeX file onto the graph to open.
        Bugs/Ideas/Comments <a href="https://github.com/timor/refgraph"> welcome</a>
      </p>
    </div>
    <script src="http://d3js.org/d3.v3.js"></script>
    <script src="scripts/jdenticon-1.3.2.js"></script>
    <script src="https://cdnjs.cloudflare.com/ajax/libs/blueimp-md5/2.3.0/js/md5.min.js"></script>
    <script src="scripts/parser.js"></script>
    <script>

      <<javascript-graph-functionality>>

    </script>
  </body>
#+END_SRC

** Styling
:PROPERTIES:
:noweb-ref: css-definitions
:END:

