refgraph.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-06-16 Do 15:56 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Reference Graph Visualization</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="timor" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Reference Graph Visualization</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Idea</a></li>
<li><a href="#orgheadline3">2. Usage</a>
<ul>
<li><a href="#orgheadline2">2.1. Advanced</a></li>
</ul>
</li>
<li><a href="#orgheadline33">3. Implementation</a>
<ul>
<li><a href="#orgheadline9">3.1. Styling</a>
<ul>
<li><a href="#orgheadline6">3.1.1. General CSS Classes</a></li>
<li><a href="#orgheadline8">3.1.2. Tooltip</a></li>
</ul>
</li>
<li><a href="#orgheadline32">3.2. Code</a>
<ul>
<li><a href="#orgheadline10">3.2.1. Global Variables</a></li>
<li><a href="#orgheadline12">3.2.2. SVG DOM Structure</a>
<ul>
<li><a href="#orgheadline7">3.2.2.1. Tooltips</a></li>
<li><a href="#orgheadline11">3.2.2.2. Filter for Node Background</a></li>
</ul>
</li>
<li><a href="#orgheadline13">3.2.3. Zooming</a></li>
<li><a href="#orgheadline26">3.2.4. Used Layouts</a>
<ul>
<li><a href="#orgheadline25">3.2.4.1. Force Layout</a></li>
</ul>
</li>
<li><a href="#orgheadline22">3.2.5. Controls</a>
<ul>
<li><a href="#orgheadline27">3.2.5.1. Display of Publication Type Symbols</a></li>
</ul>
</li>
<li><a href="#orgheadline30">3.2.6. BibTex File Loading</a>
<ul>
<li><a href="#orgheadline28">3.2.6.1. Read Files on Drag'n'Drop</a></li>
<li><a href="#orgheadline29">3.2.6.2. Analyze BibTex file</a></li>
<li><a href="#orgheadline4">3.2.6.3. BibTex Parser</a></li>
</ul>
</li>
<li><a href="#orgheadline31">3.2.7. Application Initialization/Data Loading</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline34">4. Hacking</a></li>
<li><a href="#orgheadline45">5. Plan</a>
<ul>
<li><a href="#orgheadline35">5.1. <span class="todo TODO">TODO</span> correctly implement data update mechanism</a></li>
<li><a href="#orgheadline36">5.2. <span class="todo TODO">TODO</span> rename </a></li>
<li><a href="#orgheadline37">5.3. <span class="todo TODO">TODO</span> re-implement classification layout without actually using the targets as attractors</a></li>
<li><a href="#orgheadline38">5.4. <span class="todo TODO">TODO</span> rename category -&gt; classification</a></li>
<li><a href="#orgheadline39">5.5. <span class="todo TODO">TODO</span> remove hardcoding 2016, substitute for current year</a></li>
<li><a href="#orgheadline40">5.6. <span class="todo TODO">TODO</span> switch to radial cluster for classification layout</a></li>
<li><a href="#orgheadline41">5.7. <span class="todo TODO">TODO</span> fix initial positioning in </a></li>
<li><a href="#orgheadline42">5.8. <span class="todo TODO">TODO</span> rename icon_size -&gt; node_size</a></li>
<li><a href="#orgheadline43">5.9. <span class="todo TODO">TODO</span> open pdf based on file property, not on inferred key value</a></li>
<li><a href="#orgheadline44">5.10. <span class="todo TODO">TODO</span> interpret bibtex types, assign icons, warn when required fields not present</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Idea</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Goal: get overview over certain scientific field by taking advantage
of the information that is usually provided by reference managers,
in addition to information that is usually provided by task planning systems.</li>
<li>extract information from BibTeX files:
<ul class="org-ul">
<li>author-paper relation</li>
<li>number of citations per paper (custom field)</li>
</ul></li>
<li>combine with:
<ul class="org-ul">
<li>personal progress on papers</li>
<li>personal classification on papers</li>
</ul></li>
<li>several visualization modes
<ol class="org-ol">
<li>Collaboration Graph</li>
<li>Classification (WIP)</li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">2</span> Usage</h2>
<div class="outline-text-2" id="text-2">
<p>
Open <code>index.html</code> (with Firefox).
</p>

<p>
When the page loads, an example graph is displayed.  To display your
own data, drag a file onto the canvas graph and drop it.
</p>

<p>
The layout is responsive, and nodes can be dragged with the mouse.
Dragging the background will pan the view, and mouse wheel can be used
to zoom.
</p>

<p>
Clicking a paper will try to open a pdf file with the same name in the
current directory. (Note: this will be changed to use the file name
property in the BibTex file.)
</p>

<p>
Clicking an author will redirect to a Google Scholar search with that author.
</p>

<p>
Only tested on Firefox.
</p>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> Advanced</h3>
<div class="outline-text-3" id="text-2-1">
<p>
If something unexpected happened during BibTeX file loading, a warning
or error message is printed to the browser's console.
</p>

<p>
Additional information in non-standard fields is taken into account:
</p>

<dl class="org-dl">
<dt><code>note</code></dt><dd>number of citations, as generated by the Zotero citations
plugin</dd>
<dt><code>state</code></dt><dd>personal reading state, causes colored representation of
said state.  Currently supported values: <code>unread</code>, <code>started</code>,
<code>overview</code>, and <code>read</code></dd>
<dt><code>classification</code></dt><dd>(WIP) classification of a paper in the form of
<code>category/sub category 1/further sub-category</code></dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-orgheadline33" class="outline-2">
<h2 id="orgheadline33"><span class="section-number-2">3</span> Implementation</h2>
<div class="outline-text-2" id="text-3">
<p>
The application basically consists of one html file that includes the
necessary CSS and Javascript.
</p>

<p>
It depends on d3.js for the
visualization, and on md5.js and a modified version of jdenticon for
identicon generation.
</p>

<p>
The <a href="#orgheadline4">Parser</a> responsible for extracting the information from the BibTex
files is generated using PEG.js.
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #a020f0;">!DOCTYPE</span> html&gt;
&lt;<span style="color: #0000ff;">head</span>&gt;
  &lt;<span style="color: #0000ff;">meta</span> <span style="color: #a0522d;">charset</span>=<span style="color: #8b2252;">"utf-8"</span>&gt;
  &lt;<span style="color: #0000ff;">title</span>&gt;<span style="font-weight: bold; text-decoration: underline;">BibTeX Graph Visualization (with d3.js)</span>&lt;/<span style="color: #0000ff;">title</span>&gt;
&lt;/<span style="color: #0000ff;">head</span>&gt;
&lt;<span style="color: #0000ff;">style</span>&gt;

  &lt;&lt;<span style="color: #0000ff;">css-definitions</span>&gt;&gt;

&lt;/<span style="color: #0000ff;">style</span>&gt;
&lt;<span style="color: #0000ff;">body</span>&gt;
  &lt;<span style="color: #0000ff;">svg</span> <span style="color: #a0522d;">height</span>=<span style="color: #8b2252;">"100%"</span> <span style="color: #a0522d;">width</span>=<span style="color: #8b2252;">"100%"</span>&gt;&lt;/<span style="color: #0000ff;">svg</span>&gt;
  &lt;<span style="color: #0000ff;">div</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"footer"</span>&gt;
    &lt;<span style="color: #0000ff;">p</span>&gt; Drag'n'Drop your BibTeX file onto the graph to open.
      Bugs/Ideas/Comments &lt;<span style="color: #0000ff;">a</span> <span style="color: #a0522d;">href</span>=<span style="color: #8b2252;">"https://github.com/timor/refgraph"</span>&gt; welcome&lt;/<span style="color: #0000ff;">a</span>&gt;
    &lt;/<span style="color: #0000ff;">p</span>&gt;
  &lt;/<span style="color: #0000ff;">div</span>&gt;
  &lt;<span style="color: #0000ff;">script</span> <span style="color: #a0522d;">src</span>=<span style="color: #8b2252;">"http://d3js.org/d3.v3.js"</span>&gt;&lt;/<span style="color: #0000ff;">script</span>&gt;
  &lt;<span style="color: #0000ff;">script</span> <span style="color: #a0522d;">src</span>=<span style="color: #8b2252;">"scripts/jdenticon-1.3.2.js"</span>&gt;&lt;/<span style="color: #0000ff;">script</span>&gt;
  &lt;<span style="color: #0000ff;">script</span> <span style="color: #a0522d;">src</span>=<span style="color: #8b2252;">"https://cdnjs.cloudflare.com/ajax/libs/blueimp-md5/2.3.0/js/md5.min.js"</span>&gt;&lt;/<span style="color: #0000ff;">script</span>&gt;
  &lt;<span style="color: #0000ff;">script</span> <span style="color: #a0522d;">src</span>=<span style="color: #8b2252;">"scripts/parser.js"</span>&gt;&lt;/<span style="color: #0000ff;">script</span>&gt;
  &lt;<span style="color: #0000ff;">script</span>&gt;

    &lt;&lt;<span style="color: #0000ff;">javascript-graph-functionality</span>&gt;&gt;

  &lt;/<span style="color: #0000ff;">script</span>&gt;
&lt;/<span style="color: #0000ff;">body</span>&gt;
</pre>
</div>
</div>
