refgraph.org
*** General CSS Classes

General page layout:

#+BEGIN_SRC css
  html, body { overflow: hidden }
  svg { position: fixed;
        top: 0;
        left: 0;
        width: 100%;
        height: 90%;
      }

  #footer { position: fixed;
            top: 90%
          }

  ,* {
      font-family: sans-serif;
  }
#+END_SRC

CSS Classes used:

- =.node= :: elements representing nodes (papers and authors)
- =.node_bg= :: the background of the node images (to allow image
     containing transparency to be more visible)
- =.node_bg_glow= :: the glowing background of nodes (used for visualizing state
     information)
- =.link= :: the lines representing the links between nodes
- =.<state-class>= :: contains the actual specification for each state
     of a paper
- =.author= :: author nodes
- =.paper= :: paper nodes

All text in the nodes should use sans serif fonts, and be
non-selectable, because that interferes with dragging.  Depending on
the personal state of the paper, different colors for highlighting
nodes are chosen.

#+BEGIN_SRC css
  .node text {
      // pointer-events: none;
      font: 10px sans-serif;
      -webkit-user-select: none;  /* Chrome all / Safari all */
      -moz-user-select: none;     /* Firefox all */
      -ms-user-select: none;      /* IE 10+ */
      user-select: none;          /* Likely future */
  }

  .node_bg {
      fill: white;
      stroke-width: 3px;
      stroke: gray;
  }

  .node_bg_glow.paper {
      opacity: 0.3;
      filter: url(#glow);
  }

  .node_bg.paper.read {
      stroke:green;
  }

  .node_bg.paper.unread {
      stroke:red;
  }

  .node_bg.paper.started {
      stroke:orange;
  }

  .node_bg.paper.overview {
      stroke:yellow;
  }

  .link {
      stroke: #ccc;
  }

#+END_SRC

Elements that are faded out in [[id:3bfce9ed-52e5-4fb7-8b8c-7cf798dbef31][Highlight on Hover]].  To make it a bit
smoother, add a transition effect for all nodes when changing opacity.
Note that this does not seem to work in Chrome.

#+BEGIN_SRC css
  .faded {
      opacity: 0.5;
  }

  .node {
      transition: opacity 0.2s;
  }
#+END_SRC

*** Tooltip
The tooltip is styled here. (see [[id:0ef15554-812c-48c8-924b-87567792a082][Tooltips]] section for javascript part)
- =.tooltip_text= :: text of tooltips
- =.tooltip_bg= :: background (svg rect) of tooltips

#+BEGIN_SRC css
  .tooltip_text {
      font: 12px sans-serif;
  }

  .tooltip_bg{
      fill: white;
      stroke: black;
      stroke-width: 1;
      opacity: 0.85;
  }
#+END_SRC
** Code
:PROPERTIES:
:noweb-ref: javascript-graph-functionality
:END:
*** Global Variables
For lack of better programming style, the following information is
defined in global variables:

#+NAME: js-globals
#+BEGIN_SRC js
  var width = 1200,               // width of the svg (not used correctly)

      height = 900,               // height of the svg portion (not used correctly)

      icon_size = 16,             // base size of icons for nodes

      jdenticon_size = 50        // base size of the identicons, note
                                  // that jdenticon does not allow
                                  // images smaller than 30, and padding
                                  // is added to that, so 40 should be a
                                  // safe minimum

#+END_SRC

For the actual data imported from BibTeX files:

#+NAME: data-globals
#+BEGIN_SRC js
  var nodes=[], links=[], tree;
#+END_SRC

Other globals are defined before their respective usage.

*** SVG DOM Structure
In general, d3.js functionality is used to generate the DOM elements.

The svg element should fill the whole width of the browser page, but
leave some space below for controls.  Also, pointer events have to be
caught explicitly.  These are actually later caught by the big
background rectangle (and I suppose bubbled to the svg element) to
implement zooming and panning.

Note that the variable =svg= actually contains a =g= element (group).

#+BEGIN_SRC js
  var svg = d3.select("svg")
      .attr("pointer-events", "all")
      .append("g")
      .call(d3.behavior.zoom().on('zoom', redraw))
  ;
#+END_SRC

There is a transparent background rectangle for catching mouse
events.  It is made as big as the screen to make sure that all
background is covered.

#+BEGIN_SRC js
  svg.append("rect")
      .attr("width", screen.width)
      .attr("height", screen.height)
      .style("fill", "none")
  ;
#+END_SRC

There is a container group for all interactive content.  This is also
the one that the zoom and pan transformations are performed upon:

#+BEGIN_SRC js
  var container = svg.append("g").attr("id","interactivecontainer");
#+END_SRC

When updating the layout later (e.g. by loading new data), new nodes
and links will be created.  If they are simply appended, links will
end up on top of nodes.  This clutters the view.  To prevent that,
links and nodes get their own respective sub-groups that they are
created in.  The order is important: the container for the nodes ends
up on top.

#+BEGIN_SRC js
  var link_container = container.append("g");
  var node_container = container.append("g");
#+END_SRC

