refgraph.html

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">3.1</span> Styling</h3>
<div class="outline-text-3" id="text-3-1">
</div>

<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><span class="section-number-4">3.1.1</span> General CSS Classes</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
General page layout:
</p>

<div class="org-src-container">

<pre class="src src-css"><span style="color: #0000ff;">html, body </span>{ <span style="color: #a0522d;">overflow</span>: hidden }
<span style="color: #0000ff;">svg </span>{ <span style="color: #a0522d;">position</span>: fixed;
      <span style="color: #a0522d;">top</span>: 0;
      <span style="color: #a0522d;">left</span>: 0;
      <span style="color: #a0522d;">width</span>: 100%;
      <span style="color: #a0522d;">height</span>: 90%;
    }

<span style="color: #0000ff;">#footer </span>{ <span style="color: #a0522d;">position</span>: fixed;
          <span style="color: #a0522d;">top</span>: 90%
        }

<span style="color: #0000ff;">* </span>{
    <span style="color: #a0522d;">font-family</span>: sans-serif;
}
</pre>
</div>

<p>
CSS Classes used:
</p>

<dl class="org-dl">
<dt><code>.node</code></dt><dd>elements representing nodes (papers and authors)</dd>
<dt><code>.node_bg</code></dt><dd>the background of the node images (to allow image
containing transparency to be more visible)</dd>
<dt><code>.node_bg_glow</code></dt><dd>the glowing background of nodes (used for visualizing state
information)</dd>
<dt><code>.link</code></dt><dd>the lines representing the links between nodes</dd>
<dt><code>.&lt;state-class&gt;</code></dt><dd>contains the actual specification for each state
of a paper</dd>
<dt><code>.author</code></dt><dd>author nodes</dd>
<dt><code>.paper</code></dt><dd>paper nodes</dd>
</dl>

<p>
All text in the nodes should use sans serif fonts, and be
non-selectable, because that interferes with dragging.  Depending on
the personal state of the paper, different colors for highlighting
nodes are chosen.
</p>

<div class="org-src-container">

<pre class="src src-css"><span style="color: #0000ff;">.node text </span>{
    // pointer-events: none;
    <span style="color: #a0522d;">font</span>: 10px sans-serif;
    <span style="color: #a0522d; font-style: italic;">-webkit-user-select</span>: none;  <span style="color: #b22222;">/* </span><span style="color: #b22222;">Chrome all / Safari all </span><span style="color: #b22222;">*/</span>
    <span style="color: #a0522d; font-style: italic;">-moz-user-select</span>: none;     <span style="color: #b22222;">/* </span><span style="color: #b22222;">Firefox all </span><span style="color: #b22222;">*/</span>
    <span style="color: #a0522d; font-style: italic;">-ms-user-select</span>: none;      <span style="color: #b22222;">/* </span><span style="color: #b22222;">IE 10+ </span><span style="color: #b22222;">*/</span>
    <span style="color: #a0522d;">user-select</span>: none;          <span style="color: #b22222;">/* </span><span style="color: #b22222;">Likely future </span><span style="color: #b22222;">*/</span>
}

<span style="color: #0000ff;">.node_bg </span>{
    <span style="color: #a0522d;">fill</span>: white;
    <span style="color: #a0522d;">stroke-width</span>: 3px;
    <span style="color: #a0522d;">stroke</span>: gray;
}

<span style="color: #0000ff;">.node_bg_glow.paper </span>{
    <span style="color: #a0522d;">opacity</span>: 0.3;
    <span style="color: #a0522d;">filter</span>: url(#glow);
}

<span style="color: #0000ff;">.node_bg.paper.read </span>{
    <span style="color: #a0522d;">stroke</span>:green;
}

<span style="color: #0000ff;">.node_bg.paper.unread </span>{
    <span style="color: #a0522d;">stroke</span>:red;
}

<span style="color: #0000ff;">.node_bg.paper.started </span>{
    <span style="color: #a0522d;">stroke</span>:orange;
}

<span style="color: #0000ff;">.node_bg.paper.overview </span>{
    <span style="color: #a0522d;">stroke</span>:yellow;
}

<span style="color: #0000ff;">.link </span>{
    <span style="color: #a0522d;">stroke</span>: #ccc;
}
</pre>
</div>

<p>
Elements that are faded out in <a href="#orgheadline5">Highlight on Hover</a>.  To make it a bit
smoother, add a transition effect for all nodes when changing opacity.
Note that this does not seem to work in Chrome.
</p>

<div class="org-src-container">

<pre class="src src-css"><span style="color: #0000ff;">.faded </span>{
    <span style="color: #a0522d;">opacity</span>: 0.5;
}

<span style="color: #0000ff;">.node </span>{
    <span style="color: #a0522d;">transition</span>: opacity 0.2s;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8"><span class="section-number-4">3.1.2</span> Tooltip</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
The tooltip is styled here. (see <a href="#orgheadline7">Tooltips</a> section for javascript part)
</p>
<dl class="org-dl">
<dt><code>.tooltip_text</code></dt><dd>text of tooltips</dd>
<dt><code>.tooltip_bg</code></dt><dd>background (svg rect) of tooltips</dd>
</dl>

<div class="org-src-container">

<pre class="src src-css"><span style="color: #0000ff;">.tooltip_text </span>{
    <span style="color: #a0522d;">font</span>: 12px sans-serif;
}

<span style="color: #0000ff;">.tooltip_bg</span>{
    <span style="color: #a0522d;">fill</span>: white;
    <span style="color: #a0522d;">stroke</span>: black;
    <span style="color: #a0522d;">stroke-width</span>: 1;
    <span style="color: #a0522d;">opacity</span>: 0.85;
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline32" class="outline-3">
<h3 id="orgheadline32"><span class="section-number-3">3.2</span> Code</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10"><span class="section-number-4">3.2.1</span> Global Variables</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
For lack of better programming style, the following information is
defined in global variables:
</p>

<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock1"><span style="color: #a020f0;">var</span> <span style="color: #a0522d;">width</span> = 1200,               <span style="color: #b22222;">// </span><span style="color: #b22222;">width of the svg (not used correctly)</span>

    height = 900,               <span style="color: #b22222;">// </span><span style="color: #b22222;">height of the svg portion (not used correctly)</span>

    icon_size = 16,             <span style="color: #b22222;">// </span><span style="color: #b22222;">base size of icons for nodes</span>

    jdenticon_size = 50        <span style="color: #b22222;">// </span><span style="color: #b22222;">base size of the identicons, note</span>
                                <span style="color: #b22222;">// </span><span style="color: #b22222;">that jdenticon does not allow</span>
                                <span style="color: #b22222;">// </span><span style="color: #b22222;">images smaller than 30, and padding</span>
                                <span style="color: #b22222;">// </span><span style="color: #b22222;">is added to that, so 40 should be a</span>
                                <span style="color: #b22222;">// </span><span style="color: #b22222;">safe minimum</span>
</pre>
</div>

<p>
For the actual data imported from BibTeX files:
</p>

<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock2"><span style="color: #a020f0;">var</span> <span style="color: #a0522d;">nodes</span>=[], <span style="color: #a0522d;">links</span>=[], <span style="color: #a0522d;">tree</span>;
</pre>
</div>

<p>
Other globals are defined before their respective usage.
</p>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12"><span class="section-number-4">3.2.2</span> SVG DOM Structure</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
In general, d3.js functionality is used to generate the DOM elements.
</p>

<p>
The svg element should fill the whole width of the browser page, but
leave some space below for controls.  Also, pointer events have to be
caught explicitly.  These are actually later caught by the big
background rectangle (and I suppose bubbled to the svg element) to
implement zooming and panning.
</p>

<p>
Note that the variable <code>svg</code> actually contains a <code>g</code> element (group).
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #a020f0;">var</span> <span style="color: #a0522d;">svg</span> = d3.select(<span style="color: #8b2252;">"svg"</span>)
    .attr(<span style="color: #8b2252;">"pointer-events"</span>, <span style="color: #8b2252;">"all"</span>)
    .append(<span style="color: #8b2252;">"g"</span>)
    .call(d3.behavior.zoom().on(<span style="color: #8b2252;">'zoom'</span>, redraw))
;
</pre>
</div>

<p>
There is a transparent background rectangle for catching mouse
events.  It is made as big as the screen to make sure that all
background is covered.
</p>

<div class="org-src-container">

<pre class="src src-js">svg.append(<span style="color: #8b2252;">"rect"</span>)
    .attr(<span style="color: #8b2252;">"width"</span>, screen.width)
    .attr(<span style="color: #8b2252;">"height"</span>, screen.height)
    .style(<span style="color: #8b2252;">"fill"</span>, <span style="color: #8b2252;">"none"</span>)
;
</pre>
</div>

<p>
There is a container group for all interactive content.  This is also
the one that the zoom and pan transformations are performed upon:
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #a020f0;">var</span> <span style="color: #a0522d;">container</span> = svg.append(<span style="color: #8b2252;">"g"</span>).attr(<span style="color: #8b2252;">"id"</span>,<span style="color: #8b2252;">"interactivecontainer"</span>);
</pre>
</div>

<p>
When updating the layout later (e.g. by loading new data), new nodes
and links will be created.  If they are simply appended, links will
end up on top of nodes.  This clutters the view.  To prevent that,
links and nodes get their own respective sub-groups that they are
created in.  The order is important: the container for the nodes ends
up on top.
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #a020f0;">var</span> <span style="color: #a0522d;">link_container</span> = container.append(<span style="color: #8b2252;">"g"</span>);
<span style="color: #a020f0;">var</span> <span style="color: #a0522d;">node_container</span> = container.append(<span style="color: #8b2252;">"g"</span>);
</pre>
</div>
</div>
