refgraph.org
**** Tooltips
:PROPERTIES:
:ID:       0ef15554-812c-48c8-924b-87567792a082
:END:

Tooltips appear when hovering over papers, showing the full title.

There is only one tooltip consisting of a rect and text which live in the top group,
and are placed as needed.


#+BEGIN_SRC js
  var tooltip = svg.append("rect")
      .attr("class","tooltip_bg")
      .attr("id","tooltip_bg")
      .attr("visibility", "hidden")
      .attr("rx", 4)
      .attr("ry", 4)
      .attr("height",16)
      .attr("width",52);

  var tooltip_text = svg.append("text")
      .attr("class","tooltip_text")
      .attr("visibility", "hidden");

  function show_tooltip(d) {
      if (d.type == "paper") {
          x = d3.event.clientX;
          y = d3.event.clientY;
          tooltip_text
              .text(`${d.display_title}(${d.year})`)
              .attr("visibility","visible")
              .attr("x", x + 11)
              .attr("y", y + 27);
          tooltip
              .attr("visibility","visible")
              .attr("x", x + 8)
              .attr("y", y + 14)
              .attr("width", tooltip_text.node().getComputedTextLength()+8);
      }
  }

  function hide_tooltip(d) {
      tooltip.attr("visibility", "hidden")
      tooltip_text.attr("visibility", "hidden")
  }
#+END_SRC

The =show_tooltip= and =hide_tooltip= functions are later used as
onMouseover and onMouseout handlers when the actual nodes are created
(TODO: link)

**** Filter for Node Background<<glow-filter>>
The blur effect of the node background is created here.  The defs node
is attached directly to the =svg= DOM node.

#+BEGIN_SRC js
  var defs = d3.select("svg").append("defs");
  var filter = defs.append("filter")
      .attr("id", "glow");
  filter.append("feGaussianBlur")
      .attr("stdDeviation", "3.5")
      .attr("result", "coloredBlur");
#+END_SRC
*** Zooming
Zooming is provided as d3.js-provided behavior, with the following
being the zoom event handler.

#+NAME: redraw
#+BEGIN_SRC js
  function redraw() {
      container.attr("transform", "translate(" + d3.event.translate + ")scale(" + d3.event.scale +")");
      // svg.attr("transform", "translate(" + d3.event.translate + ")");
  };
#+END_SRC

*** Used Layouts
The d3.js Layouts (currently only one) is created here.  This follows
the general update pattern suggested [[https://bl.ocks.org/mbostock/3808218][here]].


#+NAME: update_layout
#+BEGIN_SRC js
  function update_layout() {

      update_force_layout();

  }
#+END_SRC
**** Force Layout

The force layout is used to display the collaboration graph.
All the global properties are set when creating the initial =force=
object.

The d3 selections representing the nodes and links of the layout (NOT
the globals holding the actual data)
#+BEGIN_SRC js
  var force_link,                   // selection of created svg elements for link representation

      force_node                    // selection of created svg elements for node representation
#+END_SRC

For different modes, different settings are used for the following
global variables:
#+BEGIN_SRC js
  var kx_mul = 0.15,              // multiplier for attractor force in x direction

      ky_mul = 0.4                // multiplier for attractor force in y direction
#+END_SRC

*The actual layout object*

Gravity is turned off because all paper nodes have an attractor, so
the layout does face the danger of expanding indefinitely.  Charge
Distance is set, but it seems it does not have a notable influence on
performance.  It seems because charges are quite high, friction was
"increased" from the default 0.9 to 0.7 to stop high-speed movement.

#+NAME: force
#+BEGIN_SRC javascript
  var force = d3.layout.force()
      .nodes(nodes)
      .links(links)
      .linkStrength(0.5)
      .gravity(0)
      .distance(50)
      .chargeDistance(700)
      .charge(collab_charge)
      .friction(0.7)
      .size([width, height])
      .on("tick",force_tick);
#+END_SRC

***** Node Property Helper functions
Several node properties are data-dependent.  The following definitions
are used to calculate the relevant values for the layout.

****** Node Significance

Used as basis for other layout properties.

The significance of authors is determined by the balls they have, and
weighted using a fractional-exponent exponential function, to be able
to distinguish the less-significant authors better, since there are
usually more of them.

The significance of papers is the number of citations they have.  This
is weighted logarithmically for similar reasons.

#+NAME: node_significance
#+BEGIN_SRC javascript
  function node_significance(d) {
      if (d.type == "author")
          // return icon_size * (1 + (d.balls/20);
          return (1 + (Math.pow((d.balls-1), 0.8) * 0.5));
      else
          return (1 + Math.log10(1 + (d.citations || 0)));
  }
#+END_SRC

****** Node Image Positioning
The node image size depends on the significance.

#+NAME: node_image_size
#+BEGIN_SRC javascript
  function node_image_size(d) {
      return icon_size * node_significance(d);
  };
#+END_SRC

Used to center the image for a node.
#+NAME: node_image_offset
#+BEGIN_SRC javascript
  function node_image_offset(d) {
      return - (node_image_size(d) / 2);
  }
#+END_SRC

