refgraph.html

<div id="outline-container-orgheadline7" class="outline-5">
<h5 id="orgheadline7"><a id="ID-0ef15554-812c-48c8-924b-87567792a082"></a><span class="section-number-5">3.2.2.1</span> Tooltips</h5>
<div class="outline-text-5" id="text-3-2-2-1">
<p>
Tooltips appear when hovering over papers, showing the full title.
</p>

<p>
There is only one tooltip consisting of a rect and text which live in the top group,
and are placed as needed.
</p>


<div class="org-src-container">

<pre class="src src-js"><span style="color: #a020f0;">var</span> <span style="color: #a0522d;">tooltip</span> = svg.append(<span style="color: #8b2252;">"rect"</span>)
    .attr(<span style="color: #8b2252;">"class"</span>,<span style="color: #8b2252;">"tooltip_bg"</span>)
    .attr(<span style="color: #8b2252;">"id"</span>,<span style="color: #8b2252;">"tooltip_bg"</span>)
    .attr(<span style="color: #8b2252;">"visibility"</span>, <span style="color: #8b2252;">"hidden"</span>)
    .attr(<span style="color: #8b2252;">"rx"</span>, 4)
    .attr(<span style="color: #8b2252;">"ry"</span>, 4)
    .attr(<span style="color: #8b2252;">"height"</span>,16)
    .attr(<span style="color: #8b2252;">"width"</span>,52);

<span style="color: #a020f0;">var</span> <span style="color: #a0522d;">tooltip_text</span> = svg.append(<span style="color: #8b2252;">"text"</span>)
    .attr(<span style="color: #8b2252;">"class"</span>,<span style="color: #8b2252;">"tooltip_text"</span>)
    .attr(<span style="color: #8b2252;">"visibility"</span>, <span style="color: #8b2252;">"hidden"</span>);

<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">show_tooltip</span>(<span style="color: #a0522d;">d</span>) {
    <span style="color: #a020f0;">if</span> (d.type == <span style="color: #8b2252;">"paper"</span>) {
        x = d3.event.clientX;
        y = d3.event.clientY;
        tooltip_text
            .text(`${d.display_title}(${d.year})`)
            .attr(<span style="color: #8b2252;">"visibility"</span>,<span style="color: #8b2252;">"visible"</span>)
            .attr(<span style="color: #8b2252;">"x"</span>, x + 11)
            .attr(<span style="color: #8b2252;">"y"</span>, y + 27);
        tooltip
            .attr(<span style="color: #8b2252;">"visibility"</span>,<span style="color: #8b2252;">"visible"</span>)
            .attr(<span style="color: #8b2252;">"x"</span>, x + 8)
            .attr(<span style="color: #8b2252;">"y"</span>, y + 14)
            .attr(<span style="color: #8b2252;">"width"</span>, tooltip_text.node().getComputedTextLength()+8);
    }
}

<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">hide_tooltip</span>(<span style="color: #a0522d;">d</span>) {
    tooltip.attr(<span style="color: #8b2252;">"visibility"</span>, <span style="color: #8b2252;">"hidden"</span>)
    tooltip_text.attr(<span style="color: #8b2252;">"visibility"</span>, <span style="color: #8b2252;">"hidden"</span>)
}
</pre>
</div>

<p>
The <code>show_tooltip</code> and <code>hide_tooltip</code> functions are later used as
onMouseover and onMouseout handlers when the actual nodes are created
(TODO: link)
</p>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-5">
<h5 id="orgheadline11"><span class="section-number-5">3.2.2.2</span> Filter for Node Background<a id="orgtarget1"></a></h5>
<div class="outline-text-5" id="text-3-2-2-2">
<p>
The blur effect of the node background is created here.  The defs node
is attached directly to the <code>svg</code> DOM node.
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #a020f0;">var</span> <span style="color: #a0522d;">defs</span> = d3.select(<span style="color: #8b2252;">"svg"</span>).append(<span style="color: #8b2252;">"defs"</span>);
<span style="color: #a020f0;">var</span> <span style="color: #a0522d;">filter</span> = defs.append(<span style="color: #8b2252;">"filter"</span>)
    .attr(<span style="color: #8b2252;">"id"</span>, <span style="color: #8b2252;">"glow"</span>);
filter.append(<span style="color: #8b2252;">"feGaussianBlur"</span>)
    .attr(<span style="color: #8b2252;">"stdDeviation"</span>, <span style="color: #8b2252;">"3.5"</span>)
    .attr(<span style="color: #8b2252;">"result"</span>, <span style="color: #8b2252;">"coloredBlur"</span>);
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13"><span class="section-number-4">3.2.3</span> Zooming</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
Zooming is provided as d3.js-provided behavior, with the following
being the zoom event handler.
</p>

<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock3"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">redraw</span>() {
    container.attr(<span style="color: #8b2252;">"transform"</span>, <span style="color: #8b2252;">"translate("</span> + d3.event.translate + <span style="color: #8b2252;">")scale("</span> + d3.event.scale +<span style="color: #8b2252;">")"</span>);
    <span style="color: #b22222;">// </span><span style="color: #b22222;">svg.attr("transform", "translate(" + d3.event.translate + ")");</span>
};
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26"><span class="section-number-4">3.2.4</span> Used Layouts</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
The d3.js Layouts (currently only one) is created here.  This follows
the general update pattern suggested <a href="https://bl.ocks.org/mbostock/3808218">here</a>.
</p>


<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock4"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">update_layout</span>() {

    update_force_layout();

}
</pre>
</div>
</div>
<div id="outline-container-orgheadline25" class="outline-5">
<h5 id="orgheadline25"><span class="section-number-5">3.2.4.1</span> Force Layout</h5>
<div class="outline-text-5" id="text-3-2-4-1">
<p>
The force layout is used to display the collaboration graph.
All the global properties are set when creating the initial <code>force</code>
object.
</p>

<p>
The d3 selections representing the nodes and links of the layout (NOT
the globals holding the actual data)
</p>
<div class="org-src-container">

<pre class="src src-js"><span style="color: #a020f0;">var</span> <span style="color: #a0522d;">force_link</span>,                   <span style="color: #b22222;">// </span><span style="color: #b22222;">selection of created svg elements for link representation</span>

    force_node                    <span style="color: #b22222;">// </span><span style="color: #b22222;">selection of created svg elements for node representation</span>
</pre>
</div>

<p>
For different modes, different settings are used for the following
global variables:
</p>
<div class="org-src-container">

<pre class="src src-js"><span style="color: #a020f0;">var</span> <span style="color: #a0522d;">kx_mul</span> = 0.15,              <span style="color: #b22222;">// </span><span style="color: #b22222;">multiplier for attractor force in x direction</span>

    ky_mul = 0.4                <span style="color: #b22222;">// </span><span style="color: #b22222;">multiplier for attractor force in y direction</span>
</pre>
</div>

<p>
<b>The actual layout object</b>
</p>

<p>
Gravity is turned off because all paper nodes have an attractor, so
the layout does face the danger of expanding indefinitely.  Charge
Distance is set, but it seems it does not have a notable influence on
performance.  It seems because charges are quite high, friction was
"increased" from the default 0.9 to 0.7 to stop high-speed movement.
</p>

<div class="org-src-container">

<pre class="src src-javascript" id="orgsrcblock5"><span style="color: #a020f0;">var</span> <span style="color: #a0522d;">force</span> = d3.layout.force()
    .nodes(nodes)
    .links(links)
    .linkStrength(0.5)
    .gravity(0)
    .distance(50)
    .chargeDistance(700)
    .charge(collab_charge)
    .friction(0.7)
    .size([width, height])
    .on(<span style="color: #8b2252;">"tick"</span>,force_tick);
</pre>
</div>
</div>

<ol class="org-ol"><li><a id="orgheadline18"></a>Node Property Helper functions<br  /><div class="outline-text-6" id="text-3-2-4-1-1">
<p>
Several node properties are data-dependent.  The following definitions
are used to calculate the relevant values for the layout.
</p>
</div>

<ol class="org-ol"><li><a id="orgheadline14"></a>Node Significance<br  /><div class="outline-text-7" id="text-3-2-4-1-1-1">
<p>
Used as basis for other layout properties.
</p>

<p>
The significance of authors is determined by the balls they have, and
weighted using a fractional-exponent exponential function, to be able
to distinguish the less-significant authors better, since there are
usually more of them.
</p>

<p>
The significance of papers is the number of citations they have.  This
is weighted logarithmically for similar reasons.
</p>

<div class="org-src-container">

<pre class="src src-javascript" id="orgsrcblock6"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">node_significance</span>(<span style="color: #a0522d;">d</span>) {
    <span style="color: #a020f0;">if</span> (d.type == <span style="color: #8b2252;">"author"</span>)
        <span style="color: #b22222;">// </span><span style="color: #b22222;">return icon_size * (1 + (d.balls/20);</span>
        <span style="color: #a020f0;">return</span> (1 + (Math.pow((d.balls-1), 0.8) * 0.5));
    <span style="color: #a020f0;">else</span>
        <span style="color: #a020f0;">return</span> (1 + Math.log10(1 + (d.citations || 0)));
}
</pre>
</div>
</div></li>

<li><a id="orgheadline15"></a>Node Image Positioning<br  /><div class="outline-text-7" id="text-3-2-4-1-1-2">
<p>
The node image size depends on the significance.
</p>

<div class="org-src-container">

<pre class="src src-javascript" id="orgsrcblock7"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">node_image_size</span>(<span style="color: #a0522d;">d</span>) {
    <span style="color: #a020f0;">return</span> icon_size * node_significance(d);
};
</pre>
</div>

<p>
Used to center the image for a node.
</p>
<div class="org-src-container">

<pre class="src src-javascript" id="orgsrcblock8"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">node_image_offset</span>(<span style="color: #a0522d;">d</span>) {
    <span style="color: #a020f0;">return</span> - (node_image_size(d) / 2);
}
</pre>
</div>
</div></li>
