refgraph.org
****** Node Charge
For the collaboration layout, the node charge is made dependent on the
node significance.  This way, it is easier to place lesser-significant
nodes around the more central nodes.

#+NAME: collab_charge
#+BEGIN_SRC javascript
  function collab_charge(d) {
      return (node_significance(d) * -300);
  }
#+END_SRC

****** Node Attractor Targets
The attractor positions of the papers are a virtual grid, where the
papers are ordered in x-direction by the first letter of the bibtex
key, and in y-direction by the year of publication.  The y positions
are compressed in a way that recent publications are spaced wider than
older publications.

#+NAME: set_collab_paper_targets
#+BEGIN_SRC js
  function set_collab_paper_targets(node) {
      if (node.type == "paper") {
          // node.y_target = (((2020 - node.year))*20) + 200;
          node.y_target = (Math.sqrt(2020 - node.year) * 100) + 200;
          xmin = "A".charCodeAt(0);
          xmax = "Z".charCodeAt(0);
          xnode = node.name.toUpperCase().charCodeAt(0);
          node.x_target = Math.max(((xnode - xmin) / (xmax - xmin)) * width, 1);
      }
  }
#+END_SRC
***** Node Dragging Behaviour
Dragging is provided by a d3.js behavior, but the default event
handlers are not used.

#+BEGIN_SRC js
  var drag = d3.behavior.drag()
      .origin(function(d) { return d; })
      .on("dragstart", dragstarted)
      .on("drag", dragged)
      .on("dragend", dragended);
#+END_SRC

Instead, the following handlers are implemented.  Note that they rely
on undocumented internals (the meaning of the individual bits of the
=fixed= property).  These are copied from the original functions.

#+NAME: dragstarted
#+BEGIN_SRC js
  function dragstarted(d) {
      d3.event.sourceEvent.stopPropagation();
      d3.select(this).classed("dragging", true);
      // force.d3_layout_forceDragstart(d);
      d.fixed |= 2; // set bit 2
  }
#+END_SRC

#+NAME: dragged
#+BEGIN_SRC js
  function dragged(d) {
      // d3.select(this).attr("cx", d.x = d3.event.x).attr("cy", d.y = d3.event.y);
      // d.x = d3.event.x, d.y = d3.event.y;
      d.px = d3.event.x, d.py = d3.event.y;
      force.resume(); // restart annealing
  }
#+END_SRC

#+NAME: dragended
#+BEGIN_SRC js
  function dragended(d) {
      d3.select(this).classed("dragging", false);
      // force.d3_layout_forceDragend(d);
      d.fixed &= ~6; // unset bits 2 and 3
  }
#+END_SRC
***** Highlight on Hover
:PROPERTIES:
:ID:       3bfce9ed-52e5-4fb7-8b8c-7cf798dbef31
:END:
When hovering over a node, all non-connected nodes should be faded out
to better highlight the currently selected node.

The following function is for =mouseover= and =mouseout= handlers,
respectively, and change the class of the non-highlighted mode to be
faded out.

The argument determines wether to return a fade-in or a fade-out handler.

#+NAME: highlight_nodes
#+BEGIN_SRC js
  function highlight_nodes(highlight_p) {
      return function(d0) {
          force_node
              .filter(function(d) {
                  var match =
                      ( d == d0) ||
                      ((d0.type == "paper") && d0.authors.includes(d)) ||
                      ((d0.type == "author") && d0.papers.includes(d));
                  return !match;
              })
              .classed("faded", highlight_p);
      }
  }
#+END_SRC


