refgraph.html

<li><a id="orgheadline16"></a>Node Charge<br  /><div class="outline-text-7" id="text-3-2-4-1-1-3">
<p>
For the collaboration layout, the node charge is made dependent on the
node significance.  This way, it is easier to place lesser-significant
nodes around the more central nodes.
</p>

<div class="org-src-container">

<pre class="src src-javascript" id="orgsrcblock9"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">collab_charge</span>(<span style="color: #a0522d;">d</span>) {
    <span style="color: #a020f0;">return</span> (node_significance(d) * -300);
}
</pre>
</div>
</div></li>

<li><a id="orgheadline17"></a>Node Attractor Targets<br  /><div class="outline-text-7" id="text-3-2-4-1-1-4">
<p>
The attractor positions of the papers are a virtual grid, where the
papers are ordered in x-direction by the first letter of the bibtex
key, and in y-direction by the year of publication.  The y positions
are compressed in a way that recent publications are spaced wider than
older publications.
</p>

<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock10"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">set_collab_paper_targets</span>(<span style="color: #a0522d;">node</span>) {
    <span style="color: #a020f0;">if</span> (node.type == <span style="color: #8b2252;">"paper"</span>) {
        <span style="color: #b22222;">// </span><span style="color: #b22222;">node.y_target = (((2016 - node.year))*20) + 200;</span>
        node.y_target = (Math.sqrt(2016 - node.year) * 100) + 200;
        xmin = <span style="color: #8b2252;">"A"</span>.charCodeAt(0);
        xmax = <span style="color: #8b2252;">"Z"</span>.charCodeAt(0);
        xnode = node.name.toUpperCase().charCodeAt(0);
        node.x_target = Math.max(((xnode - xmin) / (xmax - xmin)) * width, 1);
    }
}
</pre>
</div>
</div></li></ol></li>
<li><a id="orgheadline19"></a>Node Dragging Behaviour<br  /><div class="outline-text-6" id="text-3-2-4-1-2">
<p>
Dragging is provided by a d3.js behavior, but the default event
handlers are not used.
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #a020f0;">var</span> <span style="color: #a0522d;">drag</span> = d3.behavior.drag()
    .origin(<span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">d</span>) { <span style="color: #a020f0;">return</span> d; })
    .on(<span style="color: #8b2252;">"dragstart"</span>, dragstarted)
    .on(<span style="color: #8b2252;">"drag"</span>, dragged)
    .on(<span style="color: #8b2252;">"dragend"</span>, dragended);
</pre>
</div>

<p>
Instead, the following handlers are implemented.  Note that they rely
on undocumented internals (the meaning of the individual bits of the
<code>fixed</code> property).  These are copied from the original functions.
</p>

<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock11"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">dragstarted</span>(<span style="color: #a0522d;">d</span>) {
    d3.event.sourceEvent.stopPropagation();
    d3.select(<span style="color: #008b8b;">this</span>).classed(<span style="color: #8b2252;">"dragging"</span>, <span style="color: #008b8b;">true</span>);
    <span style="color: #b22222;">// </span><span style="color: #b22222;">force.d3_layout_forceDragstart(d);</span>
    d.fixed |= 2; <span style="color: #b22222;">// </span><span style="color: #b22222;">set bit 2</span>
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock12"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">dragged</span>(<span style="color: #a0522d;">d</span>) {
    <span style="color: #b22222;">// </span><span style="color: #b22222;">d3.select(this).attr("cx", d.x = d3.event.x).attr("cy", d.y = d3.event.y);</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">d.x = d3.event.x, d.y = d3.event.y;</span>
    d.px = d3.event.x, d.py = d3.event.y;
    force.resume(); <span style="color: #b22222;">// </span><span style="color: #b22222;">restart annealing</span>
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock13"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">dragended</span>(<span style="color: #a0522d;">d</span>) {
    d3.select(<span style="color: #008b8b;">this</span>).classed(<span style="color: #8b2252;">"dragging"</span>, <span style="color: #008b8b;">false</span>);
    <span style="color: #b22222;">// </span><span style="color: #b22222;">force.d3_layout_forceDragend(d);</span>
    d.fixed &amp;= ~6; <span style="color: #b22222;">// </span><span style="color: #b22222;">unset bits 2 and 3</span>
}
</pre>
</div>
</div></li>
<li><a id="orgheadline5"></a><a id="ID-3bfce9ed-52e5-4fb7-8b8c-7cf798dbef31"></a>Highlight on Hover<br  /><div class="outline-text-6" id="text-3-2-4-1-3">
<p>
When hovering over a node, all non-connected nodes should be faded out
to better highlight the currently selected node.
</p>

<p>
The following function is for <code>mouseover</code> and <code>mouseout</code> handlers,
respectively, and change the class of the non-highlighted mode to be
faded out.
</p>

<p>
The argument determines wether to return a fade-in or a fade-out handler.
</p>

<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock14"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">highlight_nodes</span>(<span style="color: #a0522d;">highlight_p</span>) {
    <span style="color: #a020f0;">return</span> <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">d0</span>) {
        force_node
            .filter(<span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">d</span>) {
                <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">match</span> =
                    ( d == d0) ||
                    ((d0.type == <span style="color: #8b2252;">"paper"</span>) &amp;&amp; d0.authors.includes(d)) ||
                    ((d0.type == <span style="color: #8b2252;">"author"</span>) &amp;&amp; d0.papers.includes(d));
                <span style="color: #a020f0;">return</span> !match;
            })
            .classed(<span style="color: #8b2252;">"faded"</span>, highlight_p);
    }
}
</pre>
</div>
</div></li>
