refgraph.org
***** Force Layout Creation <<force-init>>
Here is the force layout initialization.  It must be called after data is
available.  See [[force-init]] for what actually happens, and [[id:7f4afd30-c9b3-431e-9b0c-b1f1faa074de][Force Layout Tick Handler]]
for the tick event handler that is attached.

It follows the examples [[http://bl.ocks.org/mbostock/1095795][here]], and [[http://stackoverflow.com/questions/9539294/adding-new-nodes-to-force-directed-layout][here]].

d3.js's enter selection mechanism is used to get the actually created
svg DOM nodes for the links (lines) and the nodes (groups).  The
creation is handled functions for the specific node types.  Labels are
created in the same way all node types, but link to scholar searches
for authors, and pdf files for papers.

Also cause computation of the attractor targets.

To help converging, the layout is initialized by setting all the nodes
with attractor targets to their calculated target positions.

#+NAME: update_force_layout
#+BEGIN_SRC js
  function update_force_layout() {
      force.stop();

      force.links(links)
          .nodes(nodes);

      force_link = link_container.selectAll(".link")
      // .data(force.links(), function(d) {return d.source.name + "-" + d.target.name});
          .data(force.links());

      force_link
          .enter().append("line")
          .attr("class", "link");

      force_link.exit().remove();

      force_node = node_container.selectAll(".node")
          .data(force.nodes(), function(d) {return d.name+d.state+d.bibtype+d.citations+d.balls});
      // .data(force.nodes());
      force_node
          .enter().append("g")
          .attr("class", "node")
          .on("mouseover.tool_tip", show_tooltip)
          .on("mouseout.tool_tip", hide_tooltip)
          .on("mouseover.highlight", highlight_nodes(true))
          .on("mouseout.hightlight", highlight_nodes(false))
          .call(draw_node)
          .call(drag)
      ;

      force_node.exit().remove();

      force.start().alpha(1);
  }
#+END_SRC

The creation of all the objects and setting the attributes beneath the
node element itself is delegated into =draw_node=

#+NAME: draw_node
#+BEGIN_SRC js
  function draw_node(node) {
      node.filter(function(n) {return n.type == "author"})
          .call(draw_author_node);

      node.filter(function(n) {return n.type == "paper"})
          .call(draw_paper_node);

      node.append("g")
          .append("a")
          .attr("xlink:href",function(d) {
              if (d.type == "author")
                  return "http://scholar.google.com/scholar?q=" + encodeURIComponent(d.name)
              else
                  return d.key+".pdf"})
          .append("text")
          .attr("dx", 12)
          .attr("dy", 16)
          .attr("text-anchor", "middle")
          .text(function(d) { return d.name });
  }
#+END_SRC
****** Author Nodes

Author nodes are represented by a generic image.

#+NAME: draw_author_node
#+BEGIN_SRC js
  function draw_author_node(node) {
      node.append("image")
          .attr("xlink:href", "graph-assets/user.png")
          .attr("x", node_image_offset)
          .attr("y", node_image_offset)
          .attr("width", node_image_size)
          .attr("height", node_image_size);
  }
#+END_SRC
