refgraph.html


<li><a id="orgheadline24"></a>Force Layout Creation <a id="orgtarget2"></a><br  /><div class="outline-text-6" id="text-3-2-4-1-4">
<p>
Here is the force layout initialization.  It must be called after data is
available.  See <a href="#orgtarget2">3.2.4.1.4</a> for what actually happens, and <a href="#orgheadline20">Force Layout Tick Handler</a>
for the tick event handler that is attached.
</p>

<p>
It follows the examples <a href="http://bl.ocks.org/mbostock/1095795">here</a>, and <a href="http://stackoverflow.com/questions/9539294/adding-new-nodes-to-force-directed-layout">here</a>.
</p>

<p>
d3.js's enter selection mechanism is used to get the actually created
svg DOM nodes for the links (lines) and the nodes (groups).  The
creation is handled functions for the specific node types.  Labels are
created in the same way all node types, but link to scholar searches
for authors, and pdf files for papers.
</p>

<p>
Also cause computation of the attractor targets.
</p>

<p>
To help converging, the layout is initialized by setting all the nodes
with attractor targets to their calculated target positions.
</p>

<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock15"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">update_force_layout</span>() {
    force.stop();

    force.links(links)
        .nodes(nodes);

    force_link = link_container.selectAll(<span style="color: #8b2252;">".link"</span>)
    <span style="color: #b22222;">// </span><span style="color: #b22222;">.data(force.links(), function(d) {return d.source.name + "-" + d.target.name});</span>
        .data(force.links());

    force_link
        .enter().append(<span style="color: #8b2252;">"line"</span>)
        .attr(<span style="color: #8b2252;">"class"</span>, <span style="color: #8b2252;">"link"</span>);

    force_link.exit().remove();

    force_node = node_container.selectAll(<span style="color: #8b2252;">".node"</span>)
        .data(force.nodes(), <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">d</span>) {<span style="color: #a020f0;">return</span> d.name+d.state+d.bibtype+d.citations+d.balls});
    <span style="color: #b22222;">// </span><span style="color: #b22222;">.data(force.nodes());</span>
    force_node
        .enter().append(<span style="color: #8b2252;">"g"</span>)
        .attr(<span style="color: #8b2252;">"class"</span>, <span style="color: #8b2252;">"node"</span>)
        .on(<span style="color: #8b2252;">"mouseover.tool_tip"</span>, show_tooltip)
        .on(<span style="color: #8b2252;">"mouseout.tool_tip"</span>, hide_tooltip)
        .on(<span style="color: #8b2252;">"mouseover.highlight"</span>, highlight_nodes(<span style="color: #008b8b;">true</span>))
        .on(<span style="color: #8b2252;">"mouseout.hightlight"</span>, highlight_nodes(<span style="color: #008b8b;">false</span>))
        .call(draw_node)
        .call(drag)
    ;

    force_node.exit().remove();

    force.start().alpha(1);
}
</pre>
</div>

<p>
The creation of all the objects and setting the attributes beneath the
node element itself is delegated into <code>draw_node</code>
</p>

<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock16"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">draw_node</span>(<span style="color: #a0522d;">node</span>) {
    node.filter(<span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">n</span>) {<span style="color: #a020f0;">return</span> n.type == <span style="color: #8b2252;">"author"</span>})
        .call(draw_author_node);

    node.filter(<span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">n</span>) {<span style="color: #a020f0;">return</span> n.type == <span style="color: #8b2252;">"paper"</span>})
        .call(draw_paper_node);

    node.append(<span style="color: #8b2252;">"g"</span>)
        .append(<span style="color: #8b2252;">"a"</span>)
        .attr(<span style="color: #8b2252;">"xlink:href"</span>,<span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">d</span>) {
            <span style="color: #a020f0;">if</span> (d.type == <span style="color: #8b2252;">"author"</span>)
                <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"http://scholar.google.com/scholar?q="</span> + encodeURIComponent(d.name)
            <span style="color: #a020f0;">else</span>
                <span style="color: #a020f0;">return</span> d.key+<span style="color: #8b2252;">".pdf"</span>})
        .append(<span style="color: #8b2252;">"text"</span>)
        .attr(<span style="color: #8b2252;">"dx"</span>, 12)
        .attr(<span style="color: #8b2252;">"dy"</span>, 16)
        .attr(<span style="color: #8b2252;">"text-anchor"</span>, <span style="color: #8b2252;">"middle"</span>)
        .text(<span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">d</span>) { <span style="color: #a020f0;">return</span> d.name });
}
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="orgheadline21"></a>Author Nodes<br  /><div class="outline-text-7" id="text-3-2-4-1-4-1">
<p>
Author nodes are represented by a generic image.
</p>

<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock17"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">draw_author_node</span>(<span style="color: #a0522d;">node</span>) {
    node.append(<span style="color: #8b2252;">"image"</span>)
        .attr(<span style="color: #8b2252;">"xlink:href"</span>, <span style="color: #8b2252;">"graph-assets/user.png"</span>)
        .attr(<span style="color: #8b2252;">"x"</span>, node_image_offset)
        .attr(<span style="color: #8b2252;">"y"</span>, node_image_offset)
        .attr(<span style="color: #8b2252;">"width"</span>, node_image_size)
        .attr(<span style="color: #8b2252;">"height"</span>, node_image_size);
}
</pre>
</div>
</div></li>
