refgraph.org
****** Paper Nodes
For papers that have already been started reading, show an identicon.
Otherwise, an empty placeholder.  This should make it easier to
recognize papers by their identicon over time, also visualizing where
there are still "gaps" in the research.

A small symbol represents the publication type, e.g. conference paper,
journal paper, PhD Thesis, etc.  For now, only one symbol is used,
though.  This symbol shall eventually be made optional, since it
crowds the whole layout quite a bit.  Also, this symbol is hidden by
default. See [[Controls]].

In order to make distinguishing the papers easier, md5 and jdenticon
are used to calculate hash values of the bibtex key.  The hash is
stored in the DOM attribute =data-jdenticon-hash=.  This is a
non-standard attribute so far, and is accessed by the modified
jdenticon code.

The identicon gets a white background, to make it easier to
distinguish visually.

A small circle should surround the icon which represents the personal
reading state.

Clicking the label will open a pdf.

#+NAME: draw_paper_node
#+BEGIN_SRC js
  function draw_paper_node(node) {
      // glow
      // node.append("rect")
      //     .attr("x", node_image_offset)
      //     .attr("y", node_image_offset)
      //     .attr("width", node_image_size)
      //     .attr("height", node_image_size)
      //     .attr("class", function(d) {
      //         var s= "node_bg_glow " + d.type;
      //         if (d.type == "paper" && d.state) s = s + " " + d.state;
      //         return s;
      //     });

      // white background circle with colored stroke
      node.append("circle")
          .attr("r", function(d) {return node_image_size(d) / 2.2})
          .attr("class", function(d) {
              var s = `node_bg ${d.type}`;
              if (d.state) s = s + " " + d.state;
              return s;
          })
      ;

      //jdenticon for partially read papers
      node.filter(function(n) { return (n.state && n.state != "unread")})
          .append("g")
          .attr("class", "jdenticon")
          .attr("data-width", jdenticon_size)
          .attr("data-height", jdenticon_size)
          .attr("data-jdenticon-hash", function(d) { return md5(d.name)})
          .attr("transform", function(d) { return "scale(" + node_significance(d) * (icon_size / jdenticon_size)  + ")"; });

      //type symbols
      node.append("image")
          .attr("xlink:href", "graph-assets/note.svg")
          .attr("class", "pub_type")
          .attr("x", node_image_offset)
          .attr("y", node_image_offset)
          .attr("width", function(d) {return node_image_size(d) / 2.5})
          .attr("height", function(d) {return node_image_size(d) / 2.5})
          .attr("visibility", "hidden");

  }
#+END_SRC

****** Initial Node Positions :noexport:
Initial Author Positions
The initial positions of the author nodes are set to the positions of
the paper nodes.  This is intended to allow the layout to converge
faster, but does not work well.  When the layout starts, the first few
cycles exhibit very high fluctuation amplitudes. (TODO: check if this
is better after reordering)

#+BEGIN_EXAMPLE js
  // source: author, target: paper
  links.forEach(function(link) {
      var a_index = link.source;
      var p_index = link.target;
      nodes[a_index].x = nodes[p_index].x;
      nodes[a_index].y = nodes[p_index].y;
  });
#+END_EXAMPLE
***** Force Layout Tick Handler
:PROPERTIES:
:ID:       7f4afd30-c9b3-431e-9b0c-b1f1faa074de
:END:
This is the "hot loop" that actually updates all the svg elements
according to the internal simulation.  It implements the attraction
forces and updates the position of the svg nodes as well as their
links.

#+NAME: force_tick
#+BEGIN_SRC js
  function force_tick(e) {
      var kx = e.alpha * kx_mul;
      var ky = e.alpha * ky_mul;

      nodes.forEach(function(node) {
          if (node.x_target)
              node.x += (node.x_target - node.x) * kx;
          if (node.y_target)
              node.y += (node.y_target - node.y) * ky;
      });

      force_link.attr("x1", function(d) { return d.source.x; })
          .attr("y1", function(d) { return d.source.y; })
          .attr("x2", function(d) { return d.target.x; })
          .attr("y2", function(d) { return d.target.y; });

      force_node.attr("transform", function(d) { return "translate(" + d.x + "," + d.y + ")"; });
  }
#+END_SRC
*** Controls
At the bottom of the screen, there is space for some user interface
controls.  This allows live customization of the layout.

The controls are created using d3.js.

