refgraph.html
<li><a id="orgheadline23"></a>Paper Nodes<br  /><div class="outline-text-7" id="text-3-2-4-1-4-2">
<p>
For papers that have already been started reading, show an identicon.
Otherwise, an empty placeholder.  This should make it easier to
recognize papers by their identicon over time, also visualizing where
there are still "gaps" in the research.
</p>

<p>
A small symbol represents the publication type, e.g. conference paper,
journal paper, PhD Thesis, etc.  For now, only one symbol is used,
though.  This symbol shall eventually be made optional, since it
crowds the whole layout quite a bit.  Also, this symbol is hidden by
default. See <a href="#orgheadline22">3.2.5</a>.
</p>

<p>
In order to make distinguishing the papers easier, md5 and jdenticon
are used to calculate hash values of the bibtex key.  The hash is
stored in the DOM attribute <code>data-jdenticon-hash</code>.  This is a
non-standard attribute so far, and is accessed by the modified
jdenticon code.
</p>

<p>
The identicon gets a white background, to make it easier to
distinguish visually.
</p>

<p>
A small circle should surround the icon which represents the personal
reading state.
</p>

<p>
Clicking the label will open a pdf.
</p>

<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock18"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">draw_paper_node</span>(<span style="color: #a0522d;">node</span>) {
    <span style="color: #b22222;">// </span><span style="color: #b22222;">glow</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">node.append("rect")</span>
    <span style="color: #b22222;">//     </span><span style="color: #b22222;">.attr("x", node_image_offset)</span>
    <span style="color: #b22222;">//     </span><span style="color: #b22222;">.attr("y", node_image_offset)</span>
    <span style="color: #b22222;">//     </span><span style="color: #b22222;">.attr("width", node_image_size)</span>
    <span style="color: #b22222;">//     </span><span style="color: #b22222;">.attr("height", node_image_size)</span>
    <span style="color: #b22222;">//     </span><span style="color: #b22222;">.attr("class", function(d) {</span>
    <span style="color: #b22222;">//         </span><span style="color: #b22222;">var s= "node_bg_glow " + d.type;</span>
    <span style="color: #b22222;">//         </span><span style="color: #b22222;">if (d.type == "paper" &amp;&amp; d.state) s = s + " " + d.state;</span>
    <span style="color: #b22222;">//         </span><span style="color: #b22222;">return s;</span>
    <span style="color: #b22222;">//     </span><span style="color: #b22222;">});</span>

    <span style="color: #b22222;">// </span><span style="color: #b22222;">white background circle with colored stroke</span>
    node.append(<span style="color: #8b2252;">"circle"</span>)
        .attr(<span style="color: #8b2252;">"r"</span>, <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">d</span>) {<span style="color: #a020f0;">return</span> node_image_size(d) / 2.2})
        .attr(<span style="color: #8b2252;">"class"</span>, <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">d</span>) {
            <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">s</span> = `node_bg ${d.type}`;
            <span style="color: #a020f0;">if</span> (d.state) s = s + <span style="color: #8b2252;">" "</span> + d.state;
            <span style="color: #a020f0;">return</span> s;
        })
    ;

    <span style="color: #b22222;">//</span><span style="color: #b22222;">jdenticon for partially read papers</span>
    node.filter(<span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">n</span>) { <span style="color: #a020f0;">return</span> (n.state &amp;&amp; n.state != <span style="color: #8b2252;">"unread"</span>)})
        .append(<span style="color: #8b2252;">"g"</span>)
        .attr(<span style="color: #8b2252;">"class"</span>, <span style="color: #8b2252;">"jdenticon"</span>)
        .attr(<span style="color: #8b2252;">"data-width"</span>, jdenticon_size)
        .attr(<span style="color: #8b2252;">"data-height"</span>, jdenticon_size)
        .attr(<span style="color: #8b2252;">"data-jdenticon-hash"</span>, <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">d</span>) { <span style="color: #a020f0;">return</span> md5(d.name)})
        .attr(<span style="color: #8b2252;">"transform"</span>, <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">d</span>) { <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"scale("</span> + node_significance(d) * (icon_size / jdenticon_size)  + <span style="color: #8b2252;">")"</span>; });

    <span style="color: #b22222;">//</span><span style="color: #b22222;">type symbols</span>
    node.append(<span style="color: #8b2252;">"image"</span>)
        .attr(<span style="color: #8b2252;">"xlink:href"</span>, <span style="color: #8b2252;">"graph-assets/note.svg"</span>)
        .attr(<span style="color: #8b2252;">"class"</span>, <span style="color: #8b2252;">"pub_type"</span>)
        .attr(<span style="color: #8b2252;">"x"</span>, node_image_offset)
        .attr(<span style="color: #8b2252;">"y"</span>, node_image_offset)
        .attr(<span style="color: #8b2252;">"width"</span>, <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">d</span>) {<span style="color: #a020f0;">return</span> node_image_size(d) / 2.5})
        .attr(<span style="color: #8b2252;">"height"</span>, <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">d</span>) {<span style="color: #a020f0;">return</span> node_image_size(d) / 2.5})
        .attr(<span style="color: #8b2252;">"visibility"</span>, <span style="color: #8b2252;">"hidden"</span>);

}
</pre>
</div>
</div></li></ol></li>
<li><a id="orgheadline20"></a><a id="ID-7f4afd30-c9b3-431e-9b0c-b1f1faa074de"></a>Force Layout Tick Handler<br  /><div class="outline-text-6" id="text-3-2-4-1-5">
<p>
This is the "hot loop" that actually updates all the svg elements
according to the internal simulation.  It implements the attraction
forces and updates the position of the svg nodes as well as their
links.
</p>

<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock19"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">force_tick</span>(<span style="color: #a0522d;">e</span>) {
    <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">kx</span> = e.alpha * kx_mul;
    <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">ky</span> = e.alpha * ky_mul;

    nodes.forEach(<span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">node</span>) {
        <span style="color: #a020f0;">if</span> (node.x_target)
            node.x += (node.x_target - node.x) * kx;
        <span style="color: #a020f0;">if</span> (node.y_target)
            node.y += (node.y_target - node.y) * ky;
    });

    force_link.attr(<span style="color: #8b2252;">"x1"</span>, <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">d</span>) { <span style="color: #a020f0;">return</span> d.source.x; })
        .attr(<span style="color: #8b2252;">"y1"</span>, <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">d</span>) { <span style="color: #a020f0;">return</span> d.source.y; })
        .attr(<span style="color: #8b2252;">"x2"</span>, <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">d</span>) { <span style="color: #a020f0;">return</span> d.target.x; })
        .attr(<span style="color: #8b2252;">"y2"</span>, <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">d</span>) { <span style="color: #a020f0;">return</span> d.target.y; });

    force_node.attr(<span style="color: #8b2252;">"transform"</span>, <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">d</span>) { <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"translate("</span> + d.x + <span style="color: #8b2252;">","</span> + d.y + <span style="color: #8b2252;">")"</span>; });
}
</pre>
</div>
</div></li></ol>
</div>
</div>
<div id="outline-container-orgheadline22" class="outline-4">
<h4 id="orgheadline22"><span class="section-number-4">3.2.5</span> Controls</h4>
<div class="outline-text-4" id="text-3-2-5">
<p>
At the bottom of the screen, there is space for some user interface
controls.  This allows live customization of the layout.
</p>

<p>
The controls are created using d3.js.
</p>
</div>
