refgraph.org
**** Display of Publication Type Symbols
The symbols used to display the type of publication tend to crowd the
layout, that is why they can be switched on/off. (functionality
deactivated, useless right now)

(Currently only one is used, and that one does not distinguish between
types yet)

#+BEGIN_SRC js
  var controls = d3.select("#footer")
      .append("div");

  // controls.append("label")
  //     .text("Display Type of Publication");

  // controls.append("input")
  //     .attr("type", "checkbox")
  //     // .attr("name", "show_symbols")
  //     .on("click", toggle_symbols);

  function toggle_symbols() {
      if (this.checked)
          d3.selectAll(".pub_type").attr("visibility", "visible");
      else
          d3.selectAll(".pub_type").attr("visibility", "hidden");
  }
#+END_SRC

*** BibTex File Loading
A Drag handler on the SVG element reacts to dropping a file onto the
canvas.  This causes the file to be parsed as BibTex File (see
[[BibTex Parser]]).  Nodes are compared to the existing ones.  If any
change happened, the layout is updated.

[[https://github.com/d3/d3/wiki/Selections#on][API reference for ".on()"]]

[[https://www.nczonline.net/blog/2012/05/08/working-with-files-in-javascript-part-1/][Information about FileReader with Drag'n'Drop]]

[[https://www.nczonline.net/blog/2012/05/15/working-with-files-in-javascript-part-2/][Information about reading file contents]]

**** Read Files on Drag'n'Drop

 The drop handler triggers reading the supplied file.  This (not
 visible here) in turn triggers processing the file, as described in
 the rest of the section.

 #+BEGIN_SRC js
   d3.select("svg")
       .on("dragover", function() {
           d3.event.preventDefault(); })
       .on("drop", function() {
           d3.event.preventDefault();
           var files=d3.event.dataTransfer.files;
           if (files.length == 1) {
               var f = files[0];
               console.log("Filename: " + f.name);
               console.log("Type: " + f.type);
               console.log("Size: " + f.size + " bytes");
               reader.readAsText(f);
           }
       });
 #+END_SRC

 A =FileReader= is instantiated to asynchronously load the data.
 Further processing (see also [[parse_bibtex_file]]) is initiated from its
 =onload= handler.  This includes analyzing the bibtex data and
 (re-)creating the layout.

 #+BEGIN_SRC js
   var reader = new FileReader();
   reader.onload = function(event) {
       var content = event.target.result;
       console.log("File loaded");
       load_bibtex(content);
   };

   reader.onerror = function(event) {
       console.error("Unable to read file (Code: " + event.target.error.code + ")");
   };
 #+END_SRC

 =load_bibtex_file= is used to actually perform the reading and
 trigger update of the graph.  It is taking the bibtex file as text as input.

#+NAME: load_bibtex
#+BEGIN_SRC js
  function load_bibtex(content) {
      var entries = parse_bibtex_file(content);
      var result = analyze_bibtex_entries(entries);
      nodes = result.nodes;
      links = result.links;

      nodes.forEach(function(node) {
          set_collab_paper_targets(node)  /* set the target coordinates for the papers */
          if (node.x_target) node.x = node.x_target;
          if (node.y_target) node.y = node.y_target;
      });

      update_layout();
  }
#+END_SRC

