refgraph.html

<div id="outline-container-orgheadline27" class="outline-5">
<h5 id="orgheadline27"><span class="section-number-5">3.2.5.1</span> Display of Publication Type Symbols</h5>
<div class="outline-text-5" id="text-3-2-5-1">
<p>
The symbols used to display the type of publication tend to crowd the
layout, that is why they can be switched on/off. (functionality
deactivated, useless right now)
</p>

<p>
(Currently only one is used, and that one does not distinguish between
types yet)
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #a020f0;">var</span> <span style="color: #a0522d;">controls</span> = d3.select(<span style="color: #8b2252;">"#footer"</span>)
    .append(<span style="color: #8b2252;">"div"</span>);

<span style="color: #b22222;">// </span><span style="color: #b22222;">controls.append("label")</span>
<span style="color: #b22222;">//     </span><span style="color: #b22222;">.text("Display Type of Publication");</span>

<span style="color: #b22222;">// </span><span style="color: #b22222;">controls.append("input")</span>
<span style="color: #b22222;">//     </span><span style="color: #b22222;">.attr("type", "checkbox")</span>
<span style="color: #b22222;">//     </span><span style="color: #b22222;">// .attr("name", "show_symbols")</span>
<span style="color: #b22222;">//     </span><span style="color: #b22222;">.on("click", toggle_symbols);</span>

<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">toggle_symbols</span>() {
    <span style="color: #a020f0;">if</span> (<span style="color: #008b8b;">this</span>.checked)
        d3.selectAll(<span style="color: #8b2252;">".pub_type"</span>).attr(<span style="color: #8b2252;">"visibility"</span>, <span style="color: #8b2252;">"visible"</span>);
    <span style="color: #a020f0;">else</span>
        d3.selectAll(<span style="color: #8b2252;">".pub_type"</span>).attr(<span style="color: #8b2252;">"visibility"</span>, <span style="color: #8b2252;">"hidden"</span>);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline30" class="outline-4">
<h4 id="orgheadline30"><span class="section-number-4">3.2.6</span> BibTex File Loading</h4>
<div class="outline-text-4" id="text-3-2-6">
<p>
A Drag handler on the SVG element reacts to dropping a file onto the
canvas.  This causes the file to be parsed as BibTex File (see
<a href="#orgheadline4">3.2.6.3</a>).  Nodes are compared to the existing ones.  If any
change happened, the layout is updated.
</p>

<p>
<a href="https://github.com/d3/d3/wiki/Selections#on">API reference for ".on()"</a>
</p>

<p>
<a href="https://www.nczonline.net/blog/2012/05/08/working-with-files-in-javascript-part-1/">Information about FileReader with Drag'n'Drop</a>
</p>

<p>
<a href="https://www.nczonline.net/blog/2012/05/15/working-with-files-in-javascript-part-2/">Information about reading file contents</a>
</p>
</div>

<div id="outline-container-orgheadline28" class="outline-5">
<h5 id="orgheadline28"><span class="section-number-5">3.2.6.1</span> Read Files on Drag'n'Drop</h5>
<div class="outline-text-5" id="text-3-2-6-1">
<p>
The drop handler triggers reading the supplied file.  This (not
visible here) in turn triggers processing the file, as described in
the rest of the section.
</p>

<div class="org-src-container">

<pre class="src src-js">d3.select(<span style="color: #8b2252;">"svg"</span>)
    .on(<span style="color: #8b2252;">"dragover"</span>, <span style="color: #a020f0;">function</span>() {
        d3.event.preventDefault(); })
    .on(<span style="color: #8b2252;">"drop"</span>, <span style="color: #a020f0;">function</span>() {
        d3.event.preventDefault();
        <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">files</span>=d3.event.dataTransfer.files;
        <span style="color: #a020f0;">if</span> (files.length == 1) {
            <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">f</span> = files[0];
            console.log(<span style="color: #8b2252;">"Filename: "</span> + f.name);
            console.log(<span style="color: #8b2252;">"Type: "</span> + f.type);
            console.log(<span style="color: #8b2252;">"Size: "</span> + f.size + <span style="color: #8b2252;">" bytes"</span>);
            reader.readAsText(f);
        }
    });
</pre>
</div>

<p>
A <code>FileReader</code> is instantiated to asynchronously load the data.
Further processing (see also <a href="#orgsrcblock20">1</a>) is initiated from its
<code>onload</code> handler.  This includes analyzing the bibtex data and
(re-)creating the layout.
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #a020f0;">var</span> <span style="color: #a0522d;">reader</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">FileReader</span>();
reader.onload = <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">event</span>) {
    <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">content</span> = event.target.result;
    console.log(<span style="color: #8b2252;">"File loaded"</span>);
    load_bibtex(content);
};

reader.onerror = <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">event</span>) {
    console.error(<span style="color: #8b2252;">"Unable to read file (Code: "</span> + event.target.error.code + <span style="color: #8b2252;">")"</span>);
};
</pre>
</div>

<p>
<code>load_bibtex_file</code> is used to actually perform the reading and
trigger update of the graph.  It is taking the bibtex file as text as input.
</p>

<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock21"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">load_bibtex</span>(<span style="color: #a0522d;">content</span>) {
    <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">entries</span> = parse_bibtex_file(content);
    <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">result</span> = analyze_bibtex_entries(entries);
    nodes = result.nodes;
    links = result.links;

    nodes.forEach(<span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">node</span>) {
        set_collab_paper_targets(node)  <span style="color: #b22222;">/* </span><span style="color: #b22222;">set the target coordinates for the papers */</span>
        <span style="color: #a020f0;">if</span> (node.x_target) node.x = node.x_target;
        <span style="color: #a020f0;">if</span> (node.y_target) node.y = node.y_target;
    });

    update_layout();
}
</pre>
</div>
</div>
</div>
