refgraph.org
**** Analyze BibTex file

The main information extraction happens here.  Each entry corresponds
to a paper.  The original bibtex fields are in the `bibtex` member of
the parsed entry.  Some additional properties are computed and added
to the entry itself for later use:

- =authors= :: list of parsed author objects for the paper
- =type= :: node type to distinguish during rendering.  Right now,
     `paper` and `author` are supported, and all these entries are set
     to `paper`
- =name= :: display name of the paper
- =citationse= :: number of times the paper has been cited.
     Determines the size of the node.  Right now, hardcoded to use the
     value of the field "note", because that is where the zotero
     scholar citations plugin stores the information.
- =display_title= :: de-BibTex'd title
- =year= :: publication year, just interpret bibtex field as integer
- =state= :: personal reading state

Iterating through all the nodes, link and node information is built,
and returned in a result object.  =authors= and =papers= are global
for debugging purposes.

The entries that the parser returned are reused as paper
objects, later becoming the paper nodes of the layout.

#+NAME: analyze_bibtex_entries
#+BEGIN_SRC js
  var authors, papers;

  function analyze_bibtex_entries(entries) {
      authors = [];
      papers = [];
      var links = [];
      entries.forEach(function(e) {
          if (!e.bibtex.author) { console.error(`BibTeX entry ${e.key} has no author!`); return;}
          as = author_ws_cleanup(e.bibtex.author).split(" and ").map(normalize_author).map(find_author);
          e.authors = as; //replace author list with a list of author objects
          e.type = "paper";
          e.name = e.key;
          if (e.bibtex.state) e.state = e.bibtex.state.toLowerCase();
          e.citations = parseInt(e.bibtex.note) // this is hardcoded right now according to zotero citations plugin
          if (!e.bibtex.title) {
              console.warn(`BibTeX entry ${e.key} has no title, using key instead!`)
              e.display_title = e.key;
          } else
              e.display_title = e.bibtex.title;
          e.year = parseInt(e.bibtex.year);
          e.authors.forEach(function(author) {
              author.papers.push(e);
              links.push({source: author, target: e});
              // this one is deprecated once the old json import is phased out:
              author.balls = (author.balls || 0) + 1;
          });
          papers.push(e);
      });
      return {nodes: papers.concat(authors), links: links};
  }
#+END_SRC
Several helpers are used in above code.

=author_ws_cleanup= gets rid of leading and trailing white space of an
author string, and replaces all sequences of tabs, spaces and newlines
with just a single space.

#+NAME: author_ws_cleanup
#+BEGIN_SRC js
  function author_ws_cleanup(a) {
      return a.trim().replace(/\s+/g," ");
  }
#+END_SRC

To see if a paper is attributed to a certain author, first the full
author names are compared.  If that does not match, only the first
letter of the first name is taken into account for the comparison.
This caters to the fact that authors are sometimes given by full name,
sometimes only by short name.  Note that this possibly results in
mis-attributions in the graph, when authors with the same last name
and the same first letter of the given name exist.

In this case it would be advisable to change the BibTeX source to
include the author's full name(s).

Note that when adding an author to the list of known authors, the
object previously returned by =normalize_author= is re-used and
initialized with more properties.  This is currently only the list of
attributed papers, though.


#+NAME: find_author
#+BEGIN_SRC js
  function find_author(a) {
      var found = authors.find(function(item) {
          return item.last == a.last && item.given == a.given }) ||
          authors.find(function(item) {
              return item.last == a.last && item.given[0] == a.given[0]});
      if (found)
          return found;
      else {
          // initialize author fields here
          a.papers = [];
          a.type = "author";
          a.name = a.last;        // display name
          if (a.given) a.name = a.name + ", " + a.given;
          authors.push(a);
          return a;
      }
  }
#+END_SRC

This one is responsible for normalizing an author name of an
entry.  Note that this does not follow BibTex guidelines completely,
but is able to extract the most common cases.  When in doubt,
specifying the names using "Last, First" is always the most
unambiguous way.

#+NAME: normalize_author
#+BEGIN_SRC js
  function normalize_author(s) {
      var c = s.split(", ");
      if (c.length == 1) {        // no commas?
          c = c[0].split(" ");    // split by spaces
          var last = c.pop();
          return {given: c.join(" "), last: last};
      } else
          return {given: c[c.length-1].split(" ")[0], last: c[0]};
  }
#+END_SRC

