refgraph.html

<div id="outline-container-orgheadline29" class="outline-5">
<h5 id="orgheadline29"><span class="section-number-5">3.2.6.2</span> Analyze BibTex file</h5>
<div class="outline-text-5" id="text-3-2-6-2">
<p>
The main information extraction happens here.  Each entry corresponds
to a paper.  The original bibtex fields are in the `bibtex` member of
the parsed entry.  Some additional properties are computed and added
to the entry itself for later use:
</p>

<dl class="org-dl">
<dt><code>authors</code></dt><dd>list of parsed author objects for the paper</dd>
<dt><code>type</code></dt><dd>node type to distinguish during rendering.  Right now,
`paper` and `author` are supported, and all these entries are set
to `paper`</dd>
<dt><code>name</code></dt><dd>display name of the paper</dd>
<dt><code>citationse</code></dt><dd>number of times the paper has been cited.
Determines the size of the node.  Right now, hardcoded to use the
value of the field "note", because that is where the zotero
scholar citations plugin stores the information.</dd>
<dt><code>display_title</code></dt><dd>de-BibTex'd title</dd>
<dt><code>year</code></dt><dd>publication year, just interpret bibtex field as integer</dd>
<dt><code>state</code></dt><dd>personal reading state</dd>
</dl>

<p>
Iterating through all the nodes, link and node information is built,
and returned in a result object.  <code>authors</code> and <code>papers</code> are global
for debugging purposes.
</p>

<p>
The entries that the parser returned are reused as paper
objects, later becoming the paper nodes of the layout.
</p>

<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock22"><span style="color: #a020f0;">var</span> <span style="color: #a0522d;">authors</span>, <span style="color: #a0522d;">papers</span>;

<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">analyze_bibtex_entries</span>(<span style="color: #a0522d;">entries</span>) {
    authors = [];
    papers = [];
    <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">links</span> = [];
    entries.forEach(<span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">e</span>) {
        <span style="color: #a020f0;">if</span> (!e.bibtex.author) { console.error(`BibTeX entry ${e.key} has no author!`); <span style="color: #a020f0;">return</span>;}
        as = author_ws_cleanup(e.bibtex.author).split(<span style="color: #8b2252;">" and "</span>).map(normalize_author).map(find_author);
        e.authors = as; <span style="color: #b22222;">//</span><span style="color: #b22222;">replace author list with a list of author objects</span>
        e.type = <span style="color: #8b2252;">"paper"</span>;
        e.name = e.key;
        <span style="color: #a020f0;">if</span> (e.bibtex.state) e.state = e.bibtex.state.toLowerCase();
        e.citations = parseInt(e.bibtex.note) <span style="color: #b22222;">// </span><span style="color: #b22222;">this is hardcoded right now according to zotero citations plugin</span>
        <span style="color: #a020f0;">if</span> (!e.bibtex.title) {
            console.warn(`BibTeX entry ${e.key} has no title, using key instead!`)
            e.display_title = e.key;
        } <span style="color: #a020f0;">else</span>
            e.display_title = e.bibtex.title;
        e.year = parseInt(e.bibtex.year);
        e.authors.forEach(<span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">author</span>) {
            author.papers.push(e);
            links.push({source: author, target: e});
            <span style="color: #b22222;">// </span><span style="color: #b22222;">this one is deprecated once the old json import is phased out:</span>
            author.balls = (author.balls || 0) + 1;
        });
        papers.push(e);
    });
    <span style="color: #a020f0;">return</span> {nodes: papers.concat(authors), links: links};
}
</pre>
</div>
<p>
Several helpers are used in above code.
</p>

<p>
<code>author_ws_cleanup</code> gets rid of leading and trailing white space of an
author string, and replaces all sequences of tabs, spaces and newlines
with just a single space.
</p>

<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock23"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">author_ws_cleanup</span>(<span style="color: #a0522d;">a</span>) {
    <span style="color: #a020f0;">return</span> a.trim().replace(<span style="color: #8b2252;">/\s+/</span>g,<span style="color: #8b2252;">" "</span>);
}
</pre>
</div>

<p>
To see if a paper is attributed to a certain author, first the full
author names are compared.  If that does not match, only the first
letter of the first name is taken into account for the comparison.
This caters to the fact that authors are sometimes given by full name,
sometimes only by short name.  Note that this possibly results in
mis-attributions in the graph, when authors with the same last name
and the same first letter of the given name exist.
</p>

<p>
In this case it would be advisable to change the BibTeX source to
include the author's full name(s).
</p>

<p>
Note that when adding an author to the list of known authors, the
object previously returned by <code>normalize_author</code> is re-used and
initialized with more properties.  This is currently only the list of
attributed papers, though.
</p>


<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock24"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">find_author</span>(<span style="color: #a0522d;">a</span>) {
    <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">found</span> = authors.find(<span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">item</span>) {
        <span style="color: #a020f0;">return</span> item.last == a.last &amp;&amp; item.given == a.given }) ||
        authors.find(<span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">item</span>) {
            <span style="color: #a020f0;">return</span> item.last == a.last &amp;&amp; item.given[0] == a.given[0]});
    <span style="color: #a020f0;">if</span> (found)
        <span style="color: #a020f0;">return</span> found;
    <span style="color: #a020f0;">else</span> {
        <span style="color: #b22222;">// </span><span style="color: #b22222;">initialize author fields here</span>
        a.papers = [];
        a.type = <span style="color: #8b2252;">"author"</span>;
        a.name = a.last;        <span style="color: #b22222;">// </span><span style="color: #b22222;">display name</span>
        <span style="color: #a020f0;">if</span> (a.given) a.name = a.name + <span style="color: #8b2252;">", "</span> + a.given;
        authors.push(a);
        <span style="color: #a020f0;">return</span> a;
    }
}
</pre>
</div>

<p>
This one is responsible for normalizing an author name of an
entry.  Note that this does not follow BibTex guidelines completely,
but is able to extract the most common cases.  When in doubt,
specifying the names using "Last, First" is always the most
unambiguous way.
</p>

<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock25"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">normalize_author</span>(<span style="color: #a0522d;">s</span>) {
    <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">c</span> = s.split(<span style="color: #8b2252;">", "</span>);
    <span style="color: #a020f0;">if</span> (c.length == 1) {        <span style="color: #b22222;">// </span><span style="color: #b22222;">no commas?</span>
        c = c[0].split(<span style="color: #8b2252;">" "</span>);    <span style="color: #b22222;">// </span><span style="color: #b22222;">split by spaces</span>
        <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">last</span> = c.pop();
        <span style="color: #a020f0;">return</span> {given: c.join(<span style="color: #8b2252;">" "</span>), last: last};
    } <span style="color: #a020f0;">else</span>
        <span style="color: #a020f0;">return</span> {given: c[c.length-1].split(<span style="color: #8b2252;">" "</span>)[0], last: c[0]};
}
</pre>
</div>
</div>
</div>
