refgraph.org
**** BibTex Parser
:PROPERTIES:
:ID:       034811f6-5a5d-4c94-9bd2-7afa932aafe0
:END:
BibTex files are parsed using [[https://github.com/pegjs/pegjs][PEG.js]].

Limitations:
 - no support for "@string" (if someone tells me how to handle state
   during parser execution, that would be quite easy to add)
 - when encountering variables, they are not substituted

This should not really matter, since the information in such fields is
not displayed anyways (yet).

[[http://artis.imag.fr/~Xavier.Decoret/resources/xdkbibtex/bibtex_summary.html][This page]] has very nice information about the BibTex Syntax.

This expression is used to
generate the parser:

#+BEGIN_EXAMPLE text
  start = bibtex

  _ "whitespace" = [ \t\n\r]*

  name = value:[a-zA-Z0-9_-]+ { return value.join("").toLowerCase() }
  number = value:[0-9]+ { return parseInt(value.join(""),10) }
  month_const = "jan"/"feb"/"mar"/"apr"/"may"/"jun"/"jul"/"aug"/"sep"/"oct"/"nov"/"dec"

  non_brace = value: [^{}]+ { return value.join("") }
  non_quote_non_brace = value: [^{}"]+ { return value.join("") }

  braced_value = "{" values: (non_brace / braced_value)* "}" { return values.join("") }
  quoted_value = "\"" values: (non_quote_non_brace / braced_value)* "\"" { return values.join("") }

  //fallback: when encountering an unquoted or unbrace value, assume variable name, without doing substitutions
  value = braced_value / quoted_value / number / month_const / name

  key = value:[^,]+ { return value.join("") }

  field = name:name _ "=" _ value:value { return { name:name, value:value}}
  field_with_separator = _ field:field _ "," { return field }

  normal_entry = "@" type:name _ "{" _ key:key _ "," fields:(field_with_separator)* _ last_field:field? _ '}'
    { if (last_field) fields.push(last_field);
      var ret = {bibtype: type, key: key, bibtex: {}};
      fields.forEach(function(f) { if (!ret.bibtex[f.name]) ret.bibtex[f.name] = f.value});
    return ret; }

  string = "@STRING"i _ "{" _ f:field _ "}" {error("@string directive not supported")}

  preamble = "@PREAMBLE"i _ "{" value "}"

  comment_body = value:[^@]+ {return value.join("")}

  comment_entry = "@COMMENT"i _ comment:braced_value { return comment }

  comment = comment_entry / comment_body

  entry = string / preamble / comment / normal_entry

  bibtex = elements:(entry / comment)* { return elements.filter(function(e) {return typeof(e) == "object"})}
#+END_EXAMPLE

Now we need to generate the necessary node and link data from the
parsed BibTex.  For debugging purposes, the parse tree is stored
globally.

If an exception is encountered during parsing, the parser error message is
displayed in a message box.
#+NAME: parse_bibtex_file
#+BEGIN_SRC js
  var parse_tree;

  function parse_bibtex_file(content) {
      try {
          parse_tree = bibtex_parser.parse(content);
          return parse_tree;
      } catch (e) {
          alert(`Line ${e.location.start.line}, Column ${e.location.start.column}: ${e.message}`);
          throw(e);
      }
  }
#+END_SRC

*** Application Initialization/Data Loading

When the Application is loaded, a local file "example.bib" is opened.

#+BEGIN_SRC js
  d3.text("example.bib", function(error, content) {
      if (error) throw(error);
      load_bibtex(content);
  });
#+END_SRC

* Hacking
This file is used to generate code and documentation.  It requires
org-mode which is supplied by emacs.  To (re-)generate the code file,
open this document and evaluate =org-babel-tangle=.
* Plan
** TODO correctly implement data update mechanism
see
- https://bl.ocks.org/mbostock/3808218
- https://bost.ocks.org/mike/join/
- https://bost.ocks.org/mike/constancy/
** TODO rename [[collab_charge]]
** TODO re-implement classification layout without actually using the targets as attractors
blend the current attractor position with the classification target
position instead.  This way, no actual simulation has to be done when
switching modes
** TODO rename category -> classification
** TODO remove hardcoding 2016, substitute for current year
** TODO switch to radial cluster for classification layout
** TODO fix initial positioning in [[force-init]]
Problem: initial positioning causes very unstable initial layouting.

Idea: place papers first, then add authors one after each other (at
one of their papers) to allow for settling a bit before adding
another.

Can that be done still using the entry selection?
** TODO rename icon_size -> node_size
** TODO open pdf based on file property, not on inferred key value
** TODO interpret bibtex types, assign icons, warn when required fields not present
The idea is to catch probably unintended mistakes, but be robust for
other kinds of non-well-defined fields
