refgraph.html

<div id="outline-container-orgheadline4" class="outline-5">
<h5 id="orgheadline4"><a id="ID-034811f6-5a5d-4c94-9bd2-7afa932aafe0"></a><span class="section-number-5">3.2.6.3</span> BibTex Parser</h5>
<div class="outline-text-5" id="text-3-2-6-3">
<p>
BibTex files are parsed using <a href="https://github.com/pegjs/pegjs">PEG.js</a>.
</p>

<p>
Limitations:
</p>
<ul class="org-ul">
<li>no support for "@string" (if someone tells me how to handle state
during parser execution, that would be quite easy to add)</li>
<li>when encountering variables, they are not substituted</li>
</ul>

<p>
This should not really matter, since the information in such fields is
not displayed anyways (yet).
</p>

<p>
<a href="http://artis.imag.fr/~Xavier.Decoret/resources/xdkbibtex/bibtex_summary.html">This page</a> has very nice information about the BibTex Syntax.
</p>

<p>
This expression is used to
generate the parser:
</p>

<pre class="example">
start = bibtex

_ "whitespace" = [ \t\n\r]*

name = value:[a-zA-Z0-9_-]+ { return value.join("").toLowerCase() }
number = value:[0-9]+ { return parseInt(value.join(""),10) }
month_const = "jan"/"feb"/"mar"/"apr"/"may"/"jun"/"jul"/"aug"/"sep"/"oct"/"nov"/"dec"

non_brace = value: [^{}]+ { return value.join("") }
non_quote_non_brace = value: [^{}"]+ { return value.join("") }

braced_value = "{" values: (non_brace / braced_value)* "}" { return values.join("") }
quoted_value = "\"" values: (non_quote_non_brace / braced_value)* "\"" { return values.join("") }

//fallback: when encountering an unquoted or unbrace value, assume variable name, without doing substitutions
value = braced_value / quoted_value / number / month_const / name

key = value:[^,]+ { return value.join("") }

field = name:name _ "=" _ value:value { return { name:name, value:value}}
field_with_separator = _ field:field _ "," { return field }

normal_entry = "@" type:name _ "{" _ key:key _ "," fields:(field_with_separator)* _ last_field:field? _ '}'
  { if (last_field) fields.push(last_field);
    var ret = {bibtype: type, key: key, bibtex: {}};
    fields.forEach(function(f) { if (!ret.bibtex[f.name]) ret.bibtex[f.name] = f.value});
  return ret; }

string = "@STRING"i _ "{" _ f:field _ "}" {error("@string directive not supported")}

preamble = "@PREAMBLE"i _ "{" value "}"

comment_body = value:[^@]+ {return value.join("")}

comment_entry = "@COMMENT"i _ comment:braced_value { return comment }

comment = comment_entry / comment_body

entry = string / preamble / comment / normal_entry

bibtex = elements:(entry / comment)* { return elements.filter(function(e) {return typeof(e) == "object"})}
</pre>

<p>
Now we need to generate the necessary node and link data from the
parsed BibTex.  For debugging purposes, the parse tree is stored
globally.
</p>

<p>
If an exception is encountered during parsing, the parser error message is
displayed in a message box.
</p>
<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock20"><span style="color: #a020f0;">var</span> <span style="color: #a0522d;">parse_tree</span>;

<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">parse_bibtex_file</span>(<span style="color: #a0522d;">content</span>) {
    <span style="color: #a020f0;">try</span> {
        parse_tree = bibtex_parser.parse(content);
        <span style="color: #a020f0;">return</span> parse_tree;
    } <span style="color: #a020f0;">catch</span> (e) {
        alert(`Line ${e.location.start.line}, Column ${e.location.start.column}: ${e.message}`);
        <span style="color: #a020f0;">throw</span>(e);
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline31" class="outline-4">
<h4 id="orgheadline31"><span class="section-number-4">3.2.7</span> Application Initialization/Data Loading</h4>
<div class="outline-text-4" id="text-3-2-7">
<p>
When the Application is loaded, a local file "example.bib" is opened.
</p>

<div class="org-src-container">

<pre class="src src-js">d3.text(<span style="color: #8b2252;">"example.bib"</span>, <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">error</span>, <span style="color: #a0522d;">content</span>) {
    <span style="color: #a020f0;">if</span> (error) <span style="color: #a020f0;">throw</span>(error);
    load_bibtex(content);
});
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline34" class="outline-2">
<h2 id="orgheadline34"><span class="section-number-2">4</span> Hacking</h2>
<div class="outline-text-2" id="text-4">
<p>
This file is used to generate code and documentation.  It requires
org-mode which is supplied by emacs.  To (re-)generate the code file,
open this document and evaluate <code>org-babel-tangle</code>.
</p>
</div>
</div>
<div id="outline-container-orgheadline45" class="outline-2">
<h2 id="orgheadline45"><span class="section-number-2">5</span> Plan</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgheadline35" class="outline-3">
<h3 id="orgheadline35"><span class="section-number-3">5.1</span> <span class="todo TODO">TODO</span> correctly implement data update mechanism</h3>
<div class="outline-text-3" id="text-5-1">
<p>
see
</p>
<ul class="org-ul">
<li><a href="https://bl.ocks.org/mbostock/3808218">https://bl.ocks.org/mbostock/3808218</a></li>
<li><a href="https://bost.ocks.org/mike/join/">https://bost.ocks.org/mike/join/</a></li>
<li><a href="https://bost.ocks.org/mike/constancy/">https://bost.ocks.org/mike/constancy/</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline36" class="outline-3">
<h3 id="orgheadline36"><span class="section-number-3">5.2</span> <span class="todo TODO">TODO</span> rename <a href="#orgsrcblock9">1</a></h3>
</div>
<div id="outline-container-orgheadline37" class="outline-3">
<h3 id="orgheadline37"><span class="section-number-3">5.3</span> <span class="todo TODO">TODO</span> re-implement classification layout without actually using the targets as attractors</h3>
<div class="outline-text-3" id="text-5-3">
<p>
blend the current attractor position with the classification target
position instead.  This way, no actual simulation has to be done when
switching modes
</p>
</div>
</div>
<div id="outline-container-orgheadline38" class="outline-3">
<h3 id="orgheadline38"><span class="section-number-3">5.4</span> <span class="todo TODO">TODO</span> rename category -&gt; classification</h3>
</div>
<div id="outline-container-orgheadline39" class="outline-3">
<h3 id="orgheadline39"><span class="section-number-3">5.5</span> <span class="todo TODO">TODO</span> remove hardcoding 2016, substitute for current year</h3>
</div>
<div id="outline-container-orgheadline40" class="outline-3">
<h3 id="orgheadline40"><span class="section-number-3">5.6</span> <span class="todo TODO">TODO</span> switch to radial cluster for classification layout</h3>
</div>
<div id="outline-container-orgheadline41" class="outline-3">
<h3 id="orgheadline41"><span class="section-number-3">5.7</span> <span class="todo TODO">TODO</span> fix initial positioning in <a href="#orgtarget2">3.2.4.1.4</a></h3>
<div class="outline-text-3" id="text-5-7">
<p>
Problem: initial positioning causes very unstable initial layouting.
</p>

<p>
Idea: place papers first, then add authors one after each other (at
one of their papers) to allow for settling a bit before adding
another.
</p>

<p>
Can that be done still using the entry selection?
</p>
</div>
</div>
<div id="outline-container-orgheadline42" class="outline-3">
<h3 id="orgheadline42"><span class="section-number-3">5.8</span> <span class="todo TODO">TODO</span> rename icon_size -&gt; node_size</h3>
</div>
<div id="outline-container-orgheadline43" class="outline-3">
<h3 id="orgheadline43"><span class="section-number-3">5.9</span> <span class="todo TODO">TODO</span> open pdf based on file property, not on inferred key value</h3>
</div>
<div id="outline-container-orgheadline44" class="outline-3">
<h3 id="orgheadline44"><span class="section-number-3">5.10</span> <span class="todo TODO">TODO</span> interpret bibtex types, assign icons, warn when required fields not present</h3>
<div class="outline-text-3" id="text-5-10">
<p>
The idea is to catch probably unintended mistakes, but be robust for
other kinds of non-well-defined fields
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: timor</p>
<p class="date">Created: 2016-06-16 Do 15:56</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
